package com.crm.managers;

/**
 * Created by Bohdan on 15.02.2017.
 */
public class AutoOrderManager
{
    /**
     * Реализовать метод "сформировать заказ", куда передается файлик json заказа,
     * если полученый заказ оплачен (PAID_UP), то вызываем метод доставки заказа из
     * CourierManager, предварительно выбрав из базы свободного курьера,
     * если нет - то сообщение на почту о том,
     * что заказ c таким-то номером оформлен (READY), адрес где оплатить
     * наличкой и номер счета/карточки куда можно оплатить банковской картой
     *
     * Проверить метод на работоспособность
     */
}
